Tekla Open API Reference for Tekla Structures 2025
RebarMesh.CrossSize Property
 The size of the crossing rebar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string CrossSize { get; set; }
Public Property CrossSize As String
	Get
	Set
Property Value
Type: String
See Also
Reference
RebarMesh Class
Tekla.Structures.Model Namespace